# Terraform - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging/runs/run-x7AnReNwaj4o4ugf

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.common.data.tfe_organization.default: Refreshing...
module.common.data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
module.common.data.tfe_workspace.default: Refreshing...
module.common.data.tfe_workspace.default: Refresh complete after 0s [id=ws-wwXQa69M62VYdb4M]
module.common.data.tfe_variables.default: Refreshing...
module.common.data.tfe_variables.default: Refresh complete after 0s [id=variables/ws-wwXQa69M62VYdb4M]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common.tfe_project.default will be created
  + resource "tfe_project" "default" {
      + id           = (known after apply)
      + name         = "staging"
      + organization = "connectilly"
    }

  # module.common.module.customer.tfe_variable.customer_TF_VAR_UPSTASH_API_KEY will be created
  + resource "tfe_variable" "customer_TF_VAR_UPSTASH_API_KEY" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_TF_VAR_UPSTASH_API_KEY will be created
  + resource "tfe_variable" "customer_api_TF_VAR_UPSTASH_API_KEY" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_access_key_id will be created
  + resource "tfe_variable" "customer_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_cockroach_api_key will be created
  + resource "tfe_variable" "customer_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_aws_access_key_id will be created
  + resource "tfe_variable" "customer_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_cockroach_api_key will be created
  + resource "tfe_variable" "customer_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_workspace.customer will be created
  + resource "tfe_workspace" "customer" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-customer"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "customer",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/shared/infrastructure/workspaces/staging"
    }

  # module.common.module.customer.tfe_workspace.customer_api will be created
  + resource "tfe_workspace" "customer_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-customer-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "customer",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/customer-api/infrastructure/workspaces/staging"
    }

  # module.common.module.identity.tfe_variable.identity_TF_VAR_UPSTASH_API_KEY will be created
  + resource "tfe_variable" "identity_TF_VAR_UPSTASH_API_KEY" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_TF_VAR_UPSTASH_API_KEY will be created
  + resource "tfe_variable" "identity_api_TF_VAR_UPSTASH_API_KEY" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_access_key_id will be created
  + resource "tfe_variable" "identity_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_secret_access_key will be created
  + resource "tfe_variable" "identity_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_cockroach_api_key will be created
  + resource "tfe_variable" "identity_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_aws_access_key_id will be created
  + resource "tfe_variable" "identity_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_aws_secret_access_key will be created
  + resource "tfe_variable" "identity_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_cockroach_api_key will be created
  + resource "tfe_variable" "identity_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_workspace.identity will be created
  + resource "tfe_workspace" "identity" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-identity"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "identity",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/identity/shared/infrastructure/workspaces/staging"
    }

  # module.common.module.identity.tfe_workspace.identity_api will be created
  + resource "tfe_workspace" "identity_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-identity-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "identity",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/identity/identity-api/infrastructure/workspaces/staging"
    }

  # module.common.module.organization.tfe_variable.organization_TF_VAR_UPSTASH_API_KEY will be created
  + resource "tfe_variable" "organization_TF_VAR_UPSTASH_API_KEY" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_TF_VAR_UPSTASH_API_KEY will be created
  + resource "tfe_variable" "organization_api_TF_VAR_UPSTASH_API_KEY" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_access_key_id will be created
  + resource "tfe_variable" "organization_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_secret_access_key will be created
  + resource "tfe_variable" "organization_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_cockroach_api_key will be created
  + resource "tfe_variable" "organization_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_aws_access_key_id will be created
  + resource "tfe_variable" "organization_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_aws_secret_access_key will be created
  + resource "tfe_variable" "organization_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_cockroach_api_key will be created
  + resource "tfe_variable" "organization_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_workspace.organization will be created
  + resource "tfe_workspace" "organization" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-organization"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "organization",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/organization/shared/infrastructure/workspaces/staging"
    }

  # module.common.module.organization.tfe_workspace.organization_api will be created
  + resource "tfe_workspace" "organization_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-organization-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "organization",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/organization/organization-api/infrastructure/workspaces/staging"
    }

  # module.common.module.shared.tfe_variable.shared_TF_VAR_UPSTASH_API_KEY will be created
  + resource "tfe_variable" "shared_TF_VAR_UPSTASH_API_KEY" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_variable.shared_aws_access_key_id will be created
  + resource "tfe_variable" "shared_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_variable.shared_aws_secret_access_key will be created
  + resource "tfe_variable" "shared_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_variable.shared_cockroach_api_key will be created
  + resource "tfe_variable" "shared_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_workspace.shared will be created
  + resource "tfe_workspace" "shared" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-shared"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "shared",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/shared/infrastructure/workspaces/staging"
    }

Plan: 36 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*